; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v11)
             (pred_10 ?v5 ?v4)
             (pred_12 ?v9 ?v4)
             (pred_3 ?v7 ?v9 )
	     (pred_9 ?v9)
             (pred_7 ?v3)
             (pred_5 ?v5)
             (pred_1 ?v4)
             (pred_6 ?v9)
             (pred_2 ?v5)
             (pred_4 ?v9)
             (pred_8 ))



(:action op_1
:parameters (?v2 ?v6 ?v1 ?v8)
:precondition (and (pred_7 ?v2) (pred_7 ?v6) (pred_5 ?v1) (pred_1 ?v8)
          (pred_11 ?v2 ?v6) (pred_10 ?v1 ?v8)
                   (pred_12 ?v6 ?v8) (pred_9 ?v2) 
                   (pred_6 ?v6) (pred_2 ?v1))
:effect (and  (pred_4 ?v6) (not (pred_6 ?v6))))


(:action op_5
:parameters (?v2 ?v12)
:precondition (and (pred_7 ?v2) (pred_7 ?v12)
               (pred_9 ?v2) (pred_11 ?v2 ?v12) (pred_4 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v2))))

(:action op_2
:parameters (?v2 ?v1)
:precondition (and (pred_7 ?v2) (pred_5 ?v1) 
                  (pred_9 ?v2) (pred_3 ?v1 ?v2) (pred_8 ))
:effect (and (pred_2 ?v1)
   (not (pred_3 ?v1 ?v2)) (not (pred_8 ))))


(:action op_4
:parameters (?v2 ?v10 ?v13)
:precondition (and (pred_7 ?v2) (pred_5 ?v10) (pred_5 ?v13)
                  (pred_9 ?v2) (pred_2 ?v13) (pred_3 ?v10 ?v2))
:effect (and (pred_2 ?v10) (pred_3 ?v13 ?v2)
        (not (pred_2 ?v13)) (not (pred_3 ?v10 ?v2))))

(:action op_3
:parameters (?v2 ?v1)
:precondition (and (pred_7 ?v2) (pred_5 ?v1) 
                  (pred_9 ?v2) (pred_2 ?v1))
:effect (and (pred_8 ) (pred_3 ?v1 ?v2) (not (pred_2 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_23 obj_26 obj_31 obj_08 obj_18 obj_03 obj_06 obj_30 obj_20 obj_02 obj_07 obj_17 obj_09 obj_21 obj_28 obj_14 obj_11 obj_19 obj_25 obj_22 obj_13 obj_12 obj_32 obj_05
    obj_16 obj_29 obj_10
    obj_15 obj_01 obj_04 obj_24
    )

    (:init
       (pred_8)

       (pred_7 obj_27)
       (pred_7 obj_23)
       (pred_7 obj_26)
       (pred_7 obj_31)
       (pred_7 obj_08)
       (pred_7 obj_18)
       (pred_7 obj_03)
       (pred_7 obj_06)
       (pred_7 obj_30)
       (pred_7 obj_20)
       (pred_7 obj_02)
       (pred_7 obj_07)
       (pred_7 obj_17)
       (pred_7 obj_09)
       (pred_7 obj_21)
       (pred_7 obj_28)
       (pred_7 obj_14)
       (pred_7 obj_11)
       (pred_7 obj_19)
       (pred_7 obj_25)
       (pred_7 obj_22)
       (pred_7 obj_13)
       (pred_7 obj_12)
       (pred_7 obj_32)
       (pred_7 obj_05)
       (pred_1 obj_16)
       (pred_1 obj_29)
       (pred_1 obj_10)
       (pred_5 obj_15)
       (pred_5 obj_01)
       (pred_5 obj_04)
       (pred_5 obj_24)

       (pred_11 obj_27 obj_18)
       (pred_11 obj_27 obj_23)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_23 obj_26)
       (pred_11 obj_23 obj_27)
       (pred_11 obj_26 obj_06)
       (pred_11 obj_26 obj_31)
       (pred_11 obj_26 obj_23)
       (pred_11 obj_31 obj_30)
       (pred_11 obj_31 obj_08)
       (pred_11 obj_31 obj_26)
       (pred_11 obj_08 obj_20)
       (pred_11 obj_08 obj_31)
       (pred_11 obj_18 obj_02)
       (pred_11 obj_18 obj_03)
       (pred_11 obj_18 obj_27)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_03 obj_06)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_03 obj_18)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_06 obj_30)
       (pred_11 obj_06 obj_26)
       (pred_11 obj_06 obj_03)
       (pred_11 obj_30 obj_09)
       (pred_11 obj_30 obj_20)
       (pred_11 obj_30 obj_31)
       (pred_11 obj_30 obj_06)
       (pred_11 obj_20 obj_21)
       (pred_11 obj_20 obj_08)
       (pred_11 obj_20 obj_30)
       (pred_11 obj_02 obj_28)
       (pred_11 obj_02 obj_07)
       (pred_11 obj_02 obj_18)
       (pred_11 obj_07 obj_14)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_07 obj_02)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_09)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_09 obj_19)
       (pred_11 obj_09 obj_21)
       (pred_11 obj_09 obj_30)
       (pred_11 obj_09 obj_17)
       (pred_11 obj_21 obj_25)
       (pred_11 obj_21 obj_20)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_28 obj_22)
       (pred_11 obj_28 obj_14)
       (pred_11 obj_28 obj_02)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_14 obj_07)
       (pred_11 obj_14 obj_28)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_19)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_19 obj_32)
       (pred_11 obj_19 obj_25)
       (pred_11 obj_19 obj_09)
       (pred_11 obj_19 obj_11)
       (pred_11 obj_25 obj_05)
       (pred_11 obj_25 obj_21)
       (pred_11 obj_25 obj_19)
       (pred_11 obj_22 obj_13)
       (pred_11 obj_22 obj_28)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_13 obj_22)
       (pred_11 obj_12 obj_32)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_32 obj_05)
       (pred_11 obj_32 obj_19)
       (pred_11 obj_32 obj_12)
       (pred_11 obj_05 obj_25)
       (pred_11 obj_05 obj_32)
       (pred_6 obj_19)
       (pred_6 obj_09)
       (pred_6 obj_25)
       (pred_6 obj_08)
       (pred_12  obj_19 obj_16)
       (pred_12  obj_09 obj_29)
       (pred_12  obj_25 obj_10)
       (pred_12  obj_08 obj_10)
       (pred_4 obj_27)
       (pred_4 obj_23)
       (pred_4 obj_26)
       (pred_4 obj_31)
       (pred_4 obj_18)
       (pred_4 obj_03)
       (pred_4 obj_06)
       (pred_4 obj_30)
       (pred_4 obj_20)
       (pred_4 obj_02)
       (pred_4 obj_07)
       (pred_4 obj_17)
       (pred_4 obj_21)
       (pred_4 obj_28)
       (pred_4 obj_14)
       (pred_4 obj_11)
       (pred_4 obj_22)
       (pred_4 obj_13)
       (pred_4 obj_12)
       (pred_4 obj_32)
       (pred_4 obj_05)

       (pred_10  obj_15 obj_16)
       (pred_10  obj_01 obj_29)
       (pred_10  obj_04 obj_10)
       (pred_10  obj_24 obj_29)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_01 obj_21)
       (pred_3 obj_04 obj_30)
       (pred_3 obj_24 obj_21)
       (pred_9 obj_30)
    )

    (:goal (and
       (pred_3 obj_01 obj_23)
       (pred_3 obj_24 obj_09)
    ))
(:constraints
  (always (not (pred_9 obj_31)))
)
)

; plan
1. (op_5 obj_30 obj_20)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_20)
   goals met: 0 of 2
2. (op_5 obj_20 obj_21)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_21)
   goals met: 0 of 2
3. (op_2 obj_21 obj_24)
   deleted: (pred_3 obj_24 obj_21) (pred_8)
   added: (pred_2 obj_24)
   goals met: 0 of 2
4. (op_1 obj_21 obj_09 obj_24 obj_29)
   deleted: (pred_6 obj_09)
   added: (pred_4 obj_09)
   goals met: 0 of 2
5. (op_5 obj_21 obj_09)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_09)
   goals met: 0 of 2
6. (op_3 obj_09 obj_24)
   deleted: (pred_2 obj_24)
   added: (pred_8) (pred_3 obj_24 obj_09)
   goals met: 1 of 2
7. (op_5 obj_09 obj_21)
   deleted: (pred_9 obj_09)
   added: (pred_9 obj_21)
   goals met: 1 of 2
8. (op_2 obj_21 obj_01)
   deleted: (pred_3 obj_01 obj_21) (pred_8)
   added: (pred_2 obj_01)
   goals met: 1 of 2
9. (op_5 obj_21 obj_20)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_20)
   goals met: 1 of 2
10. (op_5 obj_20 obj_30)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_30)
   goals met: 1 of 2
11. (op_5 obj_30 obj_06)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_06)
   goals met: 1 of 2
12. (op_5 obj_06 obj_26)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_26)
   goals met: 1 of 2
13. (op_5 obj_26 obj_23)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_23)
   goals met: 1 of 2
14. (op_3 obj_23 obj_01)
   deleted: (pred_2 obj_01)
   added: (pred_8) (pred_3 obj_01 obj_23)
   goals met: 2 of 2
